 gcc -g p2original.c 
îº§ gdb a.out 
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x850: file p2original.c, line 34.
(gdb) r
Starting program: /home/runner/ppa-IA2-practice2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p2original.c:34
34    int AB = input_side();
(gdb) s
input_side () at p2original.c:4
4   {
(gdb) n
6     printf("Enter a side of the triangle:\n");
(gdb) 
Enter a side of the triangle:
7     scanf("%d", &side);
(gdb) 
5
8     return side;
(gdb) p side
$1 = 5
(gdb) n
9   }
(gdb) n
main () at p2original.c:35
35    int BC = input_side();
(gdb) n
Enter a side of the triangle:
4
36    int CA = input_side();
(gdb) 
Enter a side of the triangle:
3
38    int res = check_scalene(AB, BC, CA);
(gdb) i lo
AB = 5
BC = 4
CA = 3
res = 0
(gdb) s
check_scalene (a=5, b=4, c=3) at p2original.c:13
13    if (a != b && a != c && b != c)
(gdb) n
15      return 1;
(gdb) 
18  }
(gdb) 
main () at p2original.c:39
39    output(AB, BC, CA, res);
(gdb) i lo
AB = 5
BC = 4
CA = 3
res = 1
(gdb) s
output (a=5, b=4, c=3, isScalene=1) at p2original.c:22
22    if(isScalene)
(gdb) n
24      printf("The triangle with sides %d, %d and %d is scalene\n", a, b, c);
(gdb) 
The triangle with sides 5, 4 and 3 is scalene
30  }
(gdb) 
main () at p2original.c:41
41    return 0;
(gdb) c
Continuing.
[Inferior 1 (process 1689) exited normally]
(gdb) 